{
    "who are you": "Hello, I’m CYRUS, your cognitive AI support system.",
    "what is your name": "I am called Cyrus, your assistant.",
    "who created you": "I was created by a talented student team at Government College of Engineering Kannur.",
    "what can you do": "I can tell the time, search Wikipedia, open Google or YouTube, play music, answer questions, and much more.",
    "hi hello": "Hello! How can I help you today?",
    "hello": "Hello! How can I help you today?",
    "hey": "Hello! How can I help you today?",
    "hi": "Hi there! I'm ready to assist you.",
    "how are you": "I'm functioning perfectly. Thanks for asking!",
    "tell me a joke": "Why don’t programmers like nature? It has too many bugs! Haha.",
    "what is python": "Python is a powerful, high-level programming language used for web development, ",
    "what is apci": "APCI is the International Conference on Advancements in Power, Communication, and Intelligent Systems.",
    "where is apci 2025": "It is at Government College of Engineering Kannur, Kerala, India.",
    "when is apci 2025": "APCI 2025 is on June 27 and 28, 2025.",
    "is apci 2025 offline": "APCI 2025 will be held in hybrid mode – both online and offline.",
    "who can attend the conference": "Researchers, engineers, scientists, and students from around the world.",
    "how to register": "You can register through the official conference website under the 'Registration' section.",
    "is ieee involved": "Yes, APCI 2025 is technically co-sponsored by IEEE Kerala Section.",
    "is there a submission deadline": "Yes, the notification of acceptance is extended to April 7, 2025.",
    "can i present my research": "Yes, authors are welcome to submit papers to present their research.",
    "what is the aim of the conference": "To share research developments and bring together academia and industry.",
    "how many tracks are there": "There are 10 technical tracks covering various domains.",
    "can i attend virtually": "Yes, you can attend the conference online in hybrid mode.",
    "who to contact for queries": "You can check the 'Contact Us' section on the conference website.",

    "what is track 1": "Track 1 is Power and Renewable Energy Systems. It includes smart grids, power quality, and energy management.",
    "what is track 2": "Track 2 is Electric Drives and Power Converters. It covers electric vehicles, power converter topologies, and control.",
    "what is track 3": "Track 3 is Sensors, Control, and Automation. It deals with biomedical applications, instrumentation, and automation systems.",
    "what is track 4": "Track 4 is VLSI. It includes analog/digital design, devices, ASIC/FPGA, nanoelectronics, and quantum computing.",
    "what is track 5": "Track 5 is Embedded Systems and IoT. It covers microcontroller systems, IoT devices, WSN, and robotics.",
    "what is track 6": "Track 6 is Signal Processing. Topics include image, video, audio, biomedical signals, and pattern recognition.",
    "what is track 7": "Track 7 is Communication Systems. It includes wireless, satellite, optical communication, and antennas.",
    "what is track 8": "Track 8 is Artificial Intelligence and Machine Learning. It covers NLP, generative AI, big data, and virtual reality.",
    "what is track 9": "Track 9 is Cloud Computing. It focuses on cloud systems and high performance computing.",
    "what is track 10": "Track 10 is Cyber Security and Cryptography. It deals with data security, privacy, and encryption methods.",

    "can i submit ai paper in other tracks": "Yes, if your AI work fits better with another topic, you can choose that relevant track.",
    "are topics limited to listed tracks": "No, the conference welcomes papers beyond listed topics if related to power, communication, or intelligent systems."
}